app/Controllers/Perpus.php

    public function index()
    {
        $perpus = $this->perpusModel->findAll();
---
SELECT *
FROM `perpus`

    public function save()
    {
        $this->perpusModel->save(
            [
                'nama_anggota' => $this->request->getVar('nama_anggota'),
                'kode_anggota' => $this->request->getVar('kode_anggota'),
                'tanggal_lahir' => $this->request->getVar('tanggal_lahir'),
                'tempat_lahir' => $this->request->getVar('tempat_lahir')
            ]
        );
---
INSERT INTO `perpus` (`nama_anggota`, `kode_anggota`, `tanggal_lahir`, `tempat_lahir`) VALUES ('asep', 'jio096lew6', '2000-03-12', 'Bandung')

    public function delete($id)
    {
        $this->perpusModel->delete($id);
---
DELETE FROM `perpus`
WHERE `id` IN ('4')